# Управляющие конструкции: циклы, условия в Python

[BACK](./README.md)

Управляющие конструкции позволяют программисту контролировать поток выполнения программы. В Python есть два основных типа управляющих конструкций: условия и циклы.

## Условия (if, elif, else)

Условия позволяют выполнять различные блоки кода в зависимости от истинности или ложности заданных условий.

* **if**: Выполняет блок кода, если условие истинно.
* **elif**: Выполняет блок кода, если предыдущее условие ложно, а текущее истинно.
* **else**: Выполняет блок кода, если все предыдущие условия ложны.

### Синтаксис

```python
if условие1:
    # блок кода, выполняемый, если условие1 истинно
elif условие2:
    # блок кода, выполняемый, если условие2 истинно
else:
    # блок кода, выполняемый, если все условия ложны
```

### Примеры

```python
x = 10
if x > 0:
    print("Положительное число")
elif x < 0:
    print("Отрицательное число")
else:
    print("Ноль")
```

## Циклы (for, while)

Циклы позволяют повторять выполнение блока кода несколько раз.

* **for**: Выполняет блок кода для каждого элемента в последовательности (список, кортеж, строка и т.д.).
* **while**: Выполняет блок кода, пока условие истинно.

### Синтаксис

```python
for элемент in последовательность:
    # блок кода, выполняемый для каждого элемента

while условие:
    # блок кода, выполняемый, пока условие истинно
```

### Примеры

```python
# Цикл for
for i in range(5):
    print(i)

# Цикл while
count = 0
while count < 5:
    print(count)
    count += 1
```

## Дополнительные возможности

* **break**: Прерывает выполнение цикла.
* **continue**: Пропускает текущую итерацию цикла.
* **else**: Выполняется после завершения цикла (если цикл не был прерван с помощью `break`).

### Примеры

```python
# break
for i in range(10):
    if i == 5:
        break
    print(i)

# continue
for i in range(10):
    if i % 2 == 0:
        continue
    print(i)

# else
for i in range(5):
    print(i)
else:
    print("Цикл завершен")
```

## Домашнее задание

1.  **Условия**:
    * Напишите программу, которая запрашивает у пользователя возраст и выводит, является ли он совершеннолетним или нет.
    * Напишите программу, которая запрашивает у пользователя три числа и выводит наибольшее из них.
2.  **Циклы**:
    * Напишите программу, которая выводит все четные числа от 1 до 20.
    * Напишите программу, которая запрашивает у пользователя число и выводит его факториал.
    * Напишите программу, которая запрашивает у пользователя строку и выводит ее в обратном порядке.
3.  **Дополнительно**:
    * Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно простым.
    * Напишите программу, которая выводит таблицу умножения от 1 до 10.
    * Напишите программу, которая запрашивает у пользователя строку и подсчитывает количество гласных и согласных букв в ней.